Revit 2027 API
BuiltInFailures.ImportFailures.ViewDoesNotSupportCenterToCenter Property
 The "Center to Center" option is not supported by this view because it is empty. "Origin to Internal Origin" has been used instead.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ViewDoesNotSupportCenterToCenter { get; }
Public Shared ReadOnly Property ViewDoesNotSupportCenterToCenter As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ViewDoesNotSupportCenterToCenter {
	FailureDefinitionId^ get ();
}
static member ViewDoesNotSupportCenterToCenter : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace